
/**
 * 1.理解 p73 概念
 * 2.定义全局变量 a = 0
 * 3.定义函数 f1，在函数内定义变量 a = 1 并打印 a，执行函数
 * 4.定义函数 f2，在函数内定义变量 a = 2 并打印 a，执行函数
 * 5.打印 a，并说明为什么
 */


/**
 * 理解 p74 图 4-3
 * 定义全局变量 b = 2
 * 1.定义函数 f3，在函数内打印 a，并说明为什么
 * 2.定义函数 f4，在函数内修改 a = 1，执行函数，在函数外打印 a，说明为什么
 * 3.定义函数 f5，在函数内定义变量 b = 3，执行函数，在函数外打印 b，并说明为什么
 * 4.定义函数 f6，在函数内定义变量 b = 4，在函数内定义函数 f1
 *    在 f1 内执行 b = 5，定义变量 c = 1，在 f1 内打印 a, b, c
 *    在 f6 内打印 a, b, c，然后在 f6 内执行 f1，然后在 f6 内打印 a, b, c
 *    说明打印结果的原理
 * 5.定义函数 fx，在函数内声明变量 age = 22，在函数内声明函数 printAge，在 printAge 内打印 age
 *    定义函数 fx 的返回值为 printAge
 *    在 fx 外面打印 age
 *    将 fx 执行结果赋值给变量 printAge
 *    执行 printAge() 并说明为什么
 */


/**
 * 1.定义函数 ff1，在函数内执行 for 循环，循环 5 次，用 i 做循环变量
 *    在 for 循环内用 var 和 let 分别定义变量 x 和 y，将 i 分别赋值给 x, y
 *    在循环外打印 i, x, y 并说明为什么
 * 2.理解 p81 4.3.4
 * 3.根据 2，回过头去看函数 fx 和 printAge，说明存在的问题
 */
