/** 数据类型判断
 * 1.在控制台输出 10086 的数据类型
 * 2.在控制台输出 "glj" 的数据类型
 * 3.在控制台输出 false 的数据类型
 * 4.在控制台输出 null 的数据类型，并说明为什么
 * 5.在控制台输出变量 a 的数据类型，并说明为什么
 * 6.定义一个变量 b，在控制台输出变量 b 的数据类型，并说明为什么
 * 7.定义一个函数 c（函数表达式），在控制台输出 c 的数据类型
 */

/** Boolean、Number
 * 1.将“数据类型判断”中的 值 或者 变量 分别转化为 布尔 类型并说明为什么
 * 2.将“数据类型判断”中的 值 或者 变量 分别转化为 Number 类型并说明为什么
 * 3.在控制台输出表达式 NaN == NaN 的结果，并说明为什么
 * 4.在控制台输出 Number("glj") 并说明为什么
 * 5.在控制台输出 isNaN("glj")，并说明为什么
 * 6.在控制台输出表达式 1 / 0 的结果，并输出 isInfinite(1 / 0) 的结果
 * 7.在控制台输出 1 + true 的结果，并说明为什么
 * 8.在控制台输出 1 + NaN 的结果，并说明为什么
 * 9.在控制台输出 1 + undefined 的结果，并说明为什么
 * 10.在控制台输出 1 + "2" 的结果，并说明为什么
 * 11.在控制台输出 1 + "a" 的结果，并说明为什么
 */

/** String
 * 1.将“数据类型判断”中的 值 或者 变量 用多种方式（至少 2 种）转化为 string 类型，并用 typeof 输出转换后的类型
 *    如：console.log(typeof(10086))
 * 2.在一个 console.log 中换行输出：1、2、3
 * 3.将 hello 和 world 拼接在一起并输出
 * 4.将 4 转换为二进制
 */

/** Object
 * 1.用构造函数的方式声明一个对象并赋值给 o1
 */
