/**
 * 1.定义变量 a 和 b，a = 1，给 b 赋值，值为 a，给 a 赋值，值为 2，问最后 a = ?，b = ?，为什么？
 * 2.定义变量 s1 和 s2，s1 = 'hello'，给 s2 赋值，值为 s1，给 s1 赋值，值为 a，问最后 s1 = ?，s2 = ?，为什么？
 * 3.定义变量 o，初始值是空对象，用对象字面量赋值，设置 o.name = 'glj'；定义变量 o1，将 o 赋值给 o1，打印 o1
 *    设置 o1.name = 'sdl'，打印 o，说明打印结果的原因
 * 4.定义变量 f，初始值是空函数，设置 f.glj = 'roriconn'，打印 f.glj，说明为什么
 * 5.定义变量 x，初始值 233，设置 x.glj = '2333333'，打印 x.glj，说明为什么
 */


/**
 * 定义变量 a = 1, o1 = {}
 * 1.定义函数 f1，形参 num，函数内执行 console.log(++num)
 *    调用函数 f1(a)，并在函数外打印变量 a，比较两者结果，说明为什么
 * 2.定义函数 f2，形参 a，函数内执行 console.log(++a)
 *    调用函数 f2(a)，并在函数外打印变量 a，比较两者结果，说明为什么
 * 3.定义函数 f3，形参 o，函数内给 o 增加属性 glj，属性值设为 'nb'，打印 o
 *    调用函数 f3(o1)，并在函数外打印 o1，比较两者的值，并说明为什么
 * 4.定义函数 f4，形参 o，函数内给 o 重新赋值为 { gljnb: true }，打印 o
 *    调用函数 f4(o1)，并在函数外打印 o1，比较两者的值，并说明为什么
 */
